zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMIOS.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for EMIOS
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_EMIOS.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for EMIOS
 *
 * CMSIS Peripheral Access Layer for EMIOS
 */

#if !defined(PERI_EMIOS_H_)
#define PERI_EMIOS_H_                            /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- EMIOS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMIOS_Peripheral_Access_Layer EMIOS Peripheral Access Layer
 * @{
 */

/** EMIOS - Size of Registers Arrays */
#define EMIOS_CH_UC_UC_COUNT                      24u

/** EMIOS - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  __I  uint32_t GFLAG;                             /**< Global Flag, offset: 0x4 */
  __IO uint32_t OUDIS;                             /**< Output Update Disable, offset: 0x8 */
  __IO uint32_t UCDIS;                             /**< Disable Channel, offset: 0xC */
       uint8_t RESERVED_0[16];
  struct {                                         /* offset: 0x20, array step: 0x20 */
    __IO uint32_t A;                                 /**< UC A 0..UC A 23, array offset: 0x20, array step: 0x20 */
    __IO uint32_t B;                                 /**< UC B 0..UC B 23, array offset: 0x24, array step: 0x20 */
    __IO uint32_t CNT;                               /**< UC Counter 0..UC Counter 23, array offset: 0x28, array step: 0x20, irregular array, not all indices are valid */
    __IO uint32_t C;                                 /**< UC Control 0..UC Control 23, array offset: 0x2C, array step: 0x20 */
    __IO uint32_t S;                                 /**< UC Status 0..UC Status 23, array offset: 0x30, array step: 0x20 */
    __IO uint32_t ALTA;                              /**< Alternate Address 0..Alternate Address 23, array offset: 0x34, array step: 0x20 */
    __IO uint32_t C2;                                /**< UC Control 2 0..UC Control 2 23, array offset: 0x38, array step: 0x20 */
         uint8_t RESERVED_0[4];
  } UC[EMIOS_CH_UC_UC_COUNT];
} EMIOS_Type;

/* ----------------------------------------------------------------------------
   -- EMIOS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMIOS_Register_Masks EMIOS Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define EMIOS_MCR_GPRE_MASK                      (0xFF00U)
#define EMIOS_MCR_GPRE_SHIFT                     (8U)
/*! GPRE - Global Prescaler */
#define EMIOS_MCR_GPRE(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_MCR_GPRE_SHIFT)) & EMIOS_MCR_GPRE_MASK)

#define EMIOS_MCR_GPREN_MASK                     (0x4000000U)
#define EMIOS_MCR_GPREN_SHIFT                    (26U)
/*! GPREN - Global Prescaler Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMIOS_MCR_GPREN(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_MCR_GPREN_SHIFT)) & EMIOS_MCR_GPREN_MASK)

#define EMIOS_MCR_GTBE_MASK                      (0x10000000U)
#define EMIOS_MCR_GTBE_SHIFT                     (28U)
/*! GTBE - Global Timebase Enable
 *  0b0..Deassert GTBE_OUT
 *  0b1..Assert GTBE_OUT
 */
#define EMIOS_MCR_GTBE(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_MCR_GTBE_SHIFT)) & EMIOS_MCR_GTBE_MASK)

#define EMIOS_MCR_FRZ_MASK                       (0x20000000U)
#define EMIOS_MCR_FRZ_SHIFT                      (29U)
/*! FRZ - Freeze
 *  0b0..Exit Freeze state
 *  0b1..Enter Freeze state
 */
#define EMIOS_MCR_FRZ(x)                         (((uint32_t)(((uint32_t)(x)) << EMIOS_MCR_FRZ_SHIFT)) & EMIOS_MCR_FRZ_MASK)

#define EMIOS_MCR_MDIS_MASK                      (0x40000000U)
#define EMIOS_MCR_MDIS_SHIFT                     (30U)
/*! MDIS - Module Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_MCR_MDIS(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_MCR_MDIS_SHIFT)) & EMIOS_MCR_MDIS_MASK)
/*! @} */

/*! @name GFLAG - Global Flag */
/*! @{ */

#define EMIOS_GFLAG_F0_MASK                      (0x1U)
#define EMIOS_GFLAG_F0_SHIFT                     (0U)
/*! F0 - Mirror of UC 0 FLAG */
#define EMIOS_GFLAG_F0(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F0_SHIFT)) & EMIOS_GFLAG_F0_MASK)

#define EMIOS_GFLAG_F1_MASK                      (0x2U)
#define EMIOS_GFLAG_F1_SHIFT                     (1U)
/*! F1 - Mirror of UC 1 FLAG */
#define EMIOS_GFLAG_F1(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F1_SHIFT)) & EMIOS_GFLAG_F1_MASK)

#define EMIOS_GFLAG_F2_MASK                      (0x4U)
#define EMIOS_GFLAG_F2_SHIFT                     (2U)
/*! F2 - Mirror of UC 2 FLAG */
#define EMIOS_GFLAG_F2(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F2_SHIFT)) & EMIOS_GFLAG_F2_MASK)

#define EMIOS_GFLAG_F3_MASK                      (0x8U)
#define EMIOS_GFLAG_F3_SHIFT                     (3U)
/*! F3 - Mirror of UC 3 FLAG */
#define EMIOS_GFLAG_F3(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F3_SHIFT)) & EMIOS_GFLAG_F3_MASK)

#define EMIOS_GFLAG_F4_MASK                      (0x10U)
#define EMIOS_GFLAG_F4_SHIFT                     (4U)
/*! F4 - Mirror of UC 4 FLAG */
#define EMIOS_GFLAG_F4(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F4_SHIFT)) & EMIOS_GFLAG_F4_MASK)

#define EMIOS_GFLAG_F5_MASK                      (0x20U)
#define EMIOS_GFLAG_F5_SHIFT                     (5U)
/*! F5 - Mirror of UC 5 FLAG */
#define EMIOS_GFLAG_F5(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F5_SHIFT)) & EMIOS_GFLAG_F5_MASK)

#define EMIOS_GFLAG_F6_MASK                      (0x40U)
#define EMIOS_GFLAG_F6_SHIFT                     (6U)
/*! F6 - Mirror of UC 6 FLAG */
#define EMIOS_GFLAG_F6(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F6_SHIFT)) & EMIOS_GFLAG_F6_MASK)

#define EMIOS_GFLAG_F7_MASK                      (0x80U)
#define EMIOS_GFLAG_F7_SHIFT                     (7U)
/*! F7 - Mirror of UC 7 FLAG */
#define EMIOS_GFLAG_F7(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F7_SHIFT)) & EMIOS_GFLAG_F7_MASK)

#define EMIOS_GFLAG_F8_MASK                      (0x100U)
#define EMIOS_GFLAG_F8_SHIFT                     (8U)
/*! F8 - Mirror of UC 8 FLAG */
#define EMIOS_GFLAG_F8(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F8_SHIFT)) & EMIOS_GFLAG_F8_MASK)

#define EMIOS_GFLAG_F9_MASK                      (0x200U)
#define EMIOS_GFLAG_F9_SHIFT                     (9U)
/*! F9 - Mirror of UC 9 FLAG */
#define EMIOS_GFLAG_F9(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F9_SHIFT)) & EMIOS_GFLAG_F9_MASK)

#define EMIOS_GFLAG_F10_MASK                     (0x400U)
#define EMIOS_GFLAG_F10_SHIFT                    (10U)
/*! F10 - Mirror of UC 10 FLAG */
#define EMIOS_GFLAG_F10(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F10_SHIFT)) & EMIOS_GFLAG_F10_MASK)

#define EMIOS_GFLAG_F11_MASK                     (0x800U)
#define EMIOS_GFLAG_F11_SHIFT                    (11U)
/*! F11 - Mirror of UC 11 FLAG */
#define EMIOS_GFLAG_F11(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F11_SHIFT)) & EMIOS_GFLAG_F11_MASK)

#define EMIOS_GFLAG_F12_MASK                     (0x1000U)
#define EMIOS_GFLAG_F12_SHIFT                    (12U)
/*! F12 - Mirror of UC 12 FLAG */
#define EMIOS_GFLAG_F12(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F12_SHIFT)) & EMIOS_GFLAG_F12_MASK)

#define EMIOS_GFLAG_F13_MASK                     (0x2000U)
#define EMIOS_GFLAG_F13_SHIFT                    (13U)
/*! F13 - Mirror of UC 13 FLAG */
#define EMIOS_GFLAG_F13(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F13_SHIFT)) & EMIOS_GFLAG_F13_MASK)

#define EMIOS_GFLAG_F14_MASK                     (0x4000U)
#define EMIOS_GFLAG_F14_SHIFT                    (14U)
/*! F14 - Mirror of UC 14 FLAG */
#define EMIOS_GFLAG_F14(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F14_SHIFT)) & EMIOS_GFLAG_F14_MASK)

#define EMIOS_GFLAG_F15_MASK                     (0x8000U)
#define EMIOS_GFLAG_F15_SHIFT                    (15U)
/*! F15 - Mirror of UC 15 FLAG */
#define EMIOS_GFLAG_F15(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F15_SHIFT)) & EMIOS_GFLAG_F15_MASK)

#define EMIOS_GFLAG_F16_MASK                     (0x10000U)
#define EMIOS_GFLAG_F16_SHIFT                    (16U)
/*! F16 - Mirror of UC 16 FLAG */
#define EMIOS_GFLAG_F16(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F16_SHIFT)) & EMIOS_GFLAG_F16_MASK)

#define EMIOS_GFLAG_F17_MASK                     (0x20000U)
#define EMIOS_GFLAG_F17_SHIFT                    (17U)
/*! F17 - Mirror of UC 17 FLAG */
#define EMIOS_GFLAG_F17(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F17_SHIFT)) & EMIOS_GFLAG_F17_MASK)

#define EMIOS_GFLAG_F18_MASK                     (0x40000U)
#define EMIOS_GFLAG_F18_SHIFT                    (18U)
/*! F18 - Mirror of UC 18 FLAG */
#define EMIOS_GFLAG_F18(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F18_SHIFT)) & EMIOS_GFLAG_F18_MASK)

#define EMIOS_GFLAG_F19_MASK                     (0x80000U)
#define EMIOS_GFLAG_F19_SHIFT                    (19U)
/*! F19 - Mirror of UC 19 FLAG */
#define EMIOS_GFLAG_F19(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F19_SHIFT)) & EMIOS_GFLAG_F19_MASK)

