zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMIOS.h
#define EMIOS_GFLAG_F20_MASK                     (0x100000U)
#define EMIOS_GFLAG_F20_SHIFT                    (20U)
/*! F20 - Mirror of UC 20 FLAG */
#define EMIOS_GFLAG_F20(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F20_SHIFT)) & EMIOS_GFLAG_F20_MASK)

#define EMIOS_GFLAG_F21_MASK                     (0x200000U)
#define EMIOS_GFLAG_F21_SHIFT                    (21U)
/*! F21 - Mirror of UC 21 FLAG */
#define EMIOS_GFLAG_F21(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F21_SHIFT)) & EMIOS_GFLAG_F21_MASK)

#define EMIOS_GFLAG_F22_MASK                     (0x400000U)
#define EMIOS_GFLAG_F22_SHIFT                    (22U)
/*! F22 - Mirror of UC 22 FLAG */
#define EMIOS_GFLAG_F22(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F22_SHIFT)) & EMIOS_GFLAG_F22_MASK)

#define EMIOS_GFLAG_F23_MASK                     (0x800000U)
#define EMIOS_GFLAG_F23_SHIFT                    (23U)
/*! F23 - Mirror of UC 23 FLAG */
#define EMIOS_GFLAG_F23(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_GFLAG_F23_SHIFT)) & EMIOS_GFLAG_F23_MASK)
/*! @} */

/*! @name OUDIS - Output Update Disable */
/*! @{ */

#define EMIOS_OUDIS_OU0_MASK                     (0x1U)
#define EMIOS_OUDIS_OU0_SHIFT                    (0U)
/*! OU0 - Channel 0 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU0(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU0_SHIFT)) & EMIOS_OUDIS_OU0_MASK)

#define EMIOS_OUDIS_OU1_MASK                     (0x2U)
#define EMIOS_OUDIS_OU1_SHIFT                    (1U)
/*! OU1 - Channel 1 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU1(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU1_SHIFT)) & EMIOS_OUDIS_OU1_MASK)

#define EMIOS_OUDIS_OU2_MASK                     (0x4U)
#define EMIOS_OUDIS_OU2_SHIFT                    (2U)
/*! OU2 - Channel 2 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU2(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU2_SHIFT)) & EMIOS_OUDIS_OU2_MASK)

#define EMIOS_OUDIS_OU3_MASK                     (0x8U)
#define EMIOS_OUDIS_OU3_SHIFT                    (3U)
/*! OU3 - Channel 3 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU3(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU3_SHIFT)) & EMIOS_OUDIS_OU3_MASK)

#define EMIOS_OUDIS_OU4_MASK                     (0x10U)
#define EMIOS_OUDIS_OU4_SHIFT                    (4U)
/*! OU4 - Channel 4 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU4(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU4_SHIFT)) & EMIOS_OUDIS_OU4_MASK)

#define EMIOS_OUDIS_OU5_MASK                     (0x20U)
#define EMIOS_OUDIS_OU5_SHIFT                    (5U)
/*! OU5 - Channel 5 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU5(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU5_SHIFT)) & EMIOS_OUDIS_OU5_MASK)

#define EMIOS_OUDIS_OU6_MASK                     (0x40U)
#define EMIOS_OUDIS_OU6_SHIFT                    (6U)
/*! OU6 - Channel 6 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU6(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU6_SHIFT)) & EMIOS_OUDIS_OU6_MASK)

#define EMIOS_OUDIS_OU7_MASK                     (0x80U)
#define EMIOS_OUDIS_OU7_SHIFT                    (7U)
/*! OU7 - Channel 7 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU7(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU7_SHIFT)) & EMIOS_OUDIS_OU7_MASK)

#define EMIOS_OUDIS_OU8_MASK                     (0x100U)
#define EMIOS_OUDIS_OU8_SHIFT                    (8U)
/*! OU8 - Channel 8 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU8(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU8_SHIFT)) & EMIOS_OUDIS_OU8_MASK)

#define EMIOS_OUDIS_OU9_MASK                     (0x200U)
#define EMIOS_OUDIS_OU9_SHIFT                    (9U)
/*! OU9 - Channel 9 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU9(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU9_SHIFT)) & EMIOS_OUDIS_OU9_MASK)

#define EMIOS_OUDIS_OU10_MASK                    (0x400U)
#define EMIOS_OUDIS_OU10_SHIFT                   (10U)
/*! OU10 - Channel 10 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU10(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU10_SHIFT)) & EMIOS_OUDIS_OU10_MASK)

#define EMIOS_OUDIS_OU11_MASK                    (0x800U)
#define EMIOS_OUDIS_OU11_SHIFT                   (11U)
/*! OU11 - Channel 11 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU11(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU11_SHIFT)) & EMIOS_OUDIS_OU11_MASK)

#define EMIOS_OUDIS_OU12_MASK                    (0x1000U)
#define EMIOS_OUDIS_OU12_SHIFT                   (12U)
/*! OU12 - Channel 12 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU12(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU12_SHIFT)) & EMIOS_OUDIS_OU12_MASK)

#define EMIOS_OUDIS_OU13_MASK                    (0x2000U)
#define EMIOS_OUDIS_OU13_SHIFT                   (13U)
/*! OU13 - Channel 13 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU13(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU13_SHIFT)) & EMIOS_OUDIS_OU13_MASK)

#define EMIOS_OUDIS_OU14_MASK                    (0x4000U)
#define EMIOS_OUDIS_OU14_SHIFT                   (14U)
/*! OU14 - Channel 14 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU14(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU14_SHIFT)) & EMIOS_OUDIS_OU14_MASK)

#define EMIOS_OUDIS_OU15_MASK                    (0x8000U)
#define EMIOS_OUDIS_OU15_SHIFT                   (15U)
/*! OU15 - Channel 15 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU15(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU15_SHIFT)) & EMIOS_OUDIS_OU15_MASK)

#define EMIOS_OUDIS_OU16_MASK                    (0x10000U)
#define EMIOS_OUDIS_OU16_SHIFT                   (16U)
/*! OU16 - Channel 16 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU16(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU16_SHIFT)) & EMIOS_OUDIS_OU16_MASK)

#define EMIOS_OUDIS_OU17_MASK                    (0x20000U)
#define EMIOS_OUDIS_OU17_SHIFT                   (17U)
/*! OU17 - Channel 17 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU17(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU17_SHIFT)) & EMIOS_OUDIS_OU17_MASK)

#define EMIOS_OUDIS_OU18_MASK                    (0x40000U)
#define EMIOS_OUDIS_OU18_SHIFT                   (18U)
/*! OU18 - Channel 18 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU18(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU18_SHIFT)) & EMIOS_OUDIS_OU18_MASK)

#define EMIOS_OUDIS_OU19_MASK                    (0x80000U)
#define EMIOS_OUDIS_OU19_SHIFT                   (19U)
/*! OU19 - Channel 19 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU19(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU19_SHIFT)) & EMIOS_OUDIS_OU19_MASK)

#define EMIOS_OUDIS_OU20_MASK                    (0x100000U)
#define EMIOS_OUDIS_OU20_SHIFT                   (20U)
/*! OU20 - Channel 20 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU20(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU20_SHIFT)) & EMIOS_OUDIS_OU20_MASK)

#define EMIOS_OUDIS_OU21_MASK                    (0x200000U)
#define EMIOS_OUDIS_OU21_SHIFT                   (21U)
/*! OU21 - Channel 21 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU21(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU21_SHIFT)) & EMIOS_OUDIS_OU21_MASK)

#define EMIOS_OUDIS_OU22_MASK                    (0x400000U)
#define EMIOS_OUDIS_OU22_SHIFT                   (22U)
/*! OU22 - Channel 22 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU22(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU22_SHIFT)) & EMIOS_OUDIS_OU22_MASK)

#define EMIOS_OUDIS_OU23_MASK                    (0x800000U)
#define EMIOS_OUDIS_OU23_SHIFT                   (23U)
/*! OU23 - Channel 23 Output Update Disable
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_OUDIS_OU23(x)                      (((uint32_t)(((uint32_t)(x)) << EMIOS_OUDIS_OU23_SHIFT)) & EMIOS_OUDIS_OU23_MASK)
/*! @} */

