zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMIOS.h
/*! @name UCDIS - Disable Channel */
/*! @{ */

#define EMIOS_UCDIS_UCDIS0_MASK                  (0x1U)
#define EMIOS_UCDIS_UCDIS0_SHIFT                 (0U)
/*! UCDIS0 - Disable UC 0
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS0(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS0_SHIFT)) & EMIOS_UCDIS_UCDIS0_MASK)

#define EMIOS_UCDIS_UCDIS1_MASK                  (0x2U)
#define EMIOS_UCDIS_UCDIS1_SHIFT                 (1U)
/*! UCDIS1 - Disable UC 1
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS1(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS1_SHIFT)) & EMIOS_UCDIS_UCDIS1_MASK)

#define EMIOS_UCDIS_UCDIS2_MASK                  (0x4U)
#define EMIOS_UCDIS_UCDIS2_SHIFT                 (2U)
/*! UCDIS2 - Disable UC 2
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS2(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS2_SHIFT)) & EMIOS_UCDIS_UCDIS2_MASK)

#define EMIOS_UCDIS_UCDIS3_MASK                  (0x8U)
#define EMIOS_UCDIS_UCDIS3_SHIFT                 (3U)
/*! UCDIS3 - Disable UC 3
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS3(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS3_SHIFT)) & EMIOS_UCDIS_UCDIS3_MASK)

#define EMIOS_UCDIS_UCDIS4_MASK                  (0x10U)
#define EMIOS_UCDIS_UCDIS4_SHIFT                 (4U)
/*! UCDIS4 - Disable UC 4
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS4(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS4_SHIFT)) & EMIOS_UCDIS_UCDIS4_MASK)

#define EMIOS_UCDIS_UCDIS5_MASK                  (0x20U)
#define EMIOS_UCDIS_UCDIS5_SHIFT                 (5U)
/*! UCDIS5 - Disable UC 5
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS5(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS5_SHIFT)) & EMIOS_UCDIS_UCDIS5_MASK)

#define EMIOS_UCDIS_UCDIS6_MASK                  (0x40U)
#define EMIOS_UCDIS_UCDIS6_SHIFT                 (6U)
/*! UCDIS6 - Disable UC 6
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS6(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS6_SHIFT)) & EMIOS_UCDIS_UCDIS6_MASK)

#define EMIOS_UCDIS_UCDIS7_MASK                  (0x80U)
#define EMIOS_UCDIS_UCDIS7_SHIFT                 (7U)
/*! UCDIS7 - Disable UC 7
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS7(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS7_SHIFT)) & EMIOS_UCDIS_UCDIS7_MASK)

#define EMIOS_UCDIS_UCDIS8_MASK                  (0x100U)
#define EMIOS_UCDIS_UCDIS8_SHIFT                 (8U)
/*! UCDIS8 - Disable UC 8
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS8(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS8_SHIFT)) & EMIOS_UCDIS_UCDIS8_MASK)

#define EMIOS_UCDIS_UCDIS9_MASK                  (0x200U)
#define EMIOS_UCDIS_UCDIS9_SHIFT                 (9U)
/*! UCDIS9 - Disable UC 9
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS9(x)                    (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS9_SHIFT)) & EMIOS_UCDIS_UCDIS9_MASK)

#define EMIOS_UCDIS_UCDIS10_MASK                 (0x400U)
#define EMIOS_UCDIS_UCDIS10_SHIFT                (10U)
/*! UCDIS10 - Disable UC 10
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS10(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS10_SHIFT)) & EMIOS_UCDIS_UCDIS10_MASK)

#define EMIOS_UCDIS_UCDIS11_MASK                 (0x800U)
#define EMIOS_UCDIS_UCDIS11_SHIFT                (11U)
/*! UCDIS11 - Disable UC 11
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS11(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS11_SHIFT)) & EMIOS_UCDIS_UCDIS11_MASK)

#define EMIOS_UCDIS_UCDIS12_MASK                 (0x1000U)
#define EMIOS_UCDIS_UCDIS12_SHIFT                (12U)
/*! UCDIS12 - Disable UC 12
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS12(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS12_SHIFT)) & EMIOS_UCDIS_UCDIS12_MASK)

#define EMIOS_UCDIS_UCDIS13_MASK                 (0x2000U)
#define EMIOS_UCDIS_UCDIS13_SHIFT                (13U)
/*! UCDIS13 - Disable UC 13
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS13(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS13_SHIFT)) & EMIOS_UCDIS_UCDIS13_MASK)

#define EMIOS_UCDIS_UCDIS14_MASK                 (0x4000U)
#define EMIOS_UCDIS_UCDIS14_SHIFT                (14U)
/*! UCDIS14 - Disable UC 14
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS14(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS14_SHIFT)) & EMIOS_UCDIS_UCDIS14_MASK)

#define EMIOS_UCDIS_UCDIS15_MASK                 (0x8000U)
#define EMIOS_UCDIS_UCDIS15_SHIFT                (15U)
/*! UCDIS15 - Disable UC 15
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS15(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS15_SHIFT)) & EMIOS_UCDIS_UCDIS15_MASK)

#define EMIOS_UCDIS_UCDIS16_MASK                 (0x10000U)
#define EMIOS_UCDIS_UCDIS16_SHIFT                (16U)
/*! UCDIS16 - Disable UC 16
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS16(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS16_SHIFT)) & EMIOS_UCDIS_UCDIS16_MASK)

#define EMIOS_UCDIS_UCDIS17_MASK                 (0x20000U)
#define EMIOS_UCDIS_UCDIS17_SHIFT                (17U)
/*! UCDIS17 - Disable UC 17
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS17(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS17_SHIFT)) & EMIOS_UCDIS_UCDIS17_MASK)

#define EMIOS_UCDIS_UCDIS18_MASK                 (0x40000U)
#define EMIOS_UCDIS_UCDIS18_SHIFT                (18U)
/*! UCDIS18 - Disable UC 18
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS18(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS18_SHIFT)) & EMIOS_UCDIS_UCDIS18_MASK)

#define EMIOS_UCDIS_UCDIS19_MASK                 (0x80000U)
#define EMIOS_UCDIS_UCDIS19_SHIFT                (19U)
/*! UCDIS19 - Disable UC 19
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS19(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS19_SHIFT)) & EMIOS_UCDIS_UCDIS19_MASK)

