zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMIOS.h
#define EMIOS_UCDIS_UCDIS20_MASK                 (0x100000U)
#define EMIOS_UCDIS_UCDIS20_SHIFT                (20U)
/*! UCDIS20 - Disable UC 20
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS20(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS20_SHIFT)) & EMIOS_UCDIS_UCDIS20_MASK)

#define EMIOS_UCDIS_UCDIS21_MASK                 (0x200000U)
#define EMIOS_UCDIS_UCDIS21_SHIFT                (21U)
/*! UCDIS21 - Disable UC 21
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS21(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS21_SHIFT)) & EMIOS_UCDIS_UCDIS21_MASK)

#define EMIOS_UCDIS_UCDIS22_MASK                 (0x400000U)
#define EMIOS_UCDIS_UCDIS22_SHIFT                (22U)
/*! UCDIS22 - Disable UC 22
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS22(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS22_SHIFT)) & EMIOS_UCDIS_UCDIS22_MASK)

#define EMIOS_UCDIS_UCDIS23_MASK                 (0x800000U)
#define EMIOS_UCDIS_UCDIS23_SHIFT                (23U)
/*! UCDIS23 - Disable UC 23
 *  0b0..Enable
 *  0b1..Disable
 */
#define EMIOS_UCDIS_UCDIS23(x)                   (((uint32_t)(((uint32_t)(x)) << EMIOS_UCDIS_UCDIS23_SHIFT)) & EMIOS_UCDIS_UCDIS23_MASK)
/*! @} */

/*! @name A - UC A 0..UC A 23 */
/*! @{ */

#define EMIOS_A_A_MASK                           (0xFFFFU)
#define EMIOS_A_A_SHIFT                          (0U)
/*! A - A */
#define EMIOS_A_A(x)                             (((uint32_t)(((uint32_t)(x)) << EMIOS_A_A_SHIFT)) & EMIOS_A_A_MASK)
/*! @} */

/* The count of EMIOS_A */
#define EMIOS_A_COUNT                            (24U)

/*! @name B - UC B 0..UC B 23 */
/*! @{ */

#define EMIOS_B_B_MASK                           (0xFFFFU)
#define EMIOS_B_B_SHIFT                          (0U)
/*! B - B */
#define EMIOS_B_B(x)                             (((uint32_t)(((uint32_t)(x)) << EMIOS_B_B_SHIFT)) & EMIOS_B_B_MASK)
/*! @} */

/* The count of EMIOS_B */
#define EMIOS_B_COUNT                            (24U)

/*! @name CNT - UC Counter 0..UC Counter 23 */
/*! @{ */

#define EMIOS_CNT_C_MASK                         (0xFFFFU)
#define EMIOS_CNT_C_SHIFT                        (0U)
/*! C - Internal Counter Value */
#define EMIOS_CNT_C(x)                           (((uint32_t)(((uint32_t)(x)) << EMIOS_CNT_C_SHIFT)) & EMIOS_CNT_C_MASK)
/*! @} */

/* The count of EMIOS_CNT */
#define EMIOS_CNT_COUNT                          (24U)

/*! @name C - UC Control 0..UC Control 23 */
/*! @{ */

#define EMIOS_C_MODE_MASK                        (0x7FU)
#define EMIOS_C_MODE_SHIFT                       (0U)
/*! MODE - Mode Selection */
#define EMIOS_C_MODE(x)                          (((uint32_t)(((uint32_t)(x)) << EMIOS_C_MODE_SHIFT)) & EMIOS_C_MODE_MASK)

#define EMIOS_C_EDPOL_MASK                       (0x80U)
#define EMIOS_C_EDPOL_SHIFT                      (7U)
/*! EDPOL - Edge Polarity */
#define EMIOS_C_EDPOL(x)                         (((uint32_t)(((uint32_t)(x)) << EMIOS_C_EDPOL_SHIFT)) & EMIOS_C_EDPOL_MASK)

#define EMIOS_C_EDSEL_MASK                       (0x100U)
#define EMIOS_C_EDSEL_SHIFT                      (8U)
/*! EDSEL - Edge Selection */
#define EMIOS_C_EDSEL(x)                         (((uint32_t)(((uint32_t)(x)) << EMIOS_C_EDSEL_SHIFT)) & EMIOS_C_EDSEL_MASK)

#define EMIOS_C_BSL_MASK                         (0x600U)
#define EMIOS_C_BSL_SHIFT                        (9U)
/*! BSL - Bus Select */
#define EMIOS_C_BSL(x)                           (((uint32_t)(((uint32_t)(x)) << EMIOS_C_BSL_SHIFT)) & EMIOS_C_BSL_MASK)

#define EMIOS_C_FORCMB_MASK                      (0x1000U)
#define EMIOS_C_FORCMB_SHIFT                     (12U)
/*! FORCMB - Force Match B
 *  0b0..No effect
 *  0b1..Force a match at comparator B
 */
#define EMIOS_C_FORCMB(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_C_FORCMB_SHIFT)) & EMIOS_C_FORCMB_MASK)

#define EMIOS_C_FORCMA_MASK                      (0x2000U)
#define EMIOS_C_FORCMA_SHIFT                     (13U)
/*! FORCMA - Force Match A
 *  0b0..No effect
 *  0b1..Force a match at comparator A
 */
#define EMIOS_C_FORCMA(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_C_FORCMA_SHIFT)) & EMIOS_C_FORCMA_MASK)

#define EMIOS_C_FEN_MASK                         (0x20000U)
#define EMIOS_C_FEN_SHIFT                        (17U)
/*! FEN - Flag Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMIOS_C_FEN(x)                           (((uint32_t)(((uint32_t)(x)) << EMIOS_C_FEN_SHIFT)) & EMIOS_C_FEN_MASK)

#define EMIOS_C_FCK_MASK                         (0x40000U)
#define EMIOS_C_FCK_SHIFT                        (18U)
/*! FCK - Filter Clock Select
 *  0b0..Prescaled clock
 *  0b1..eMIOS module clock
 */
#define EMIOS_C_FCK(x)                           (((uint32_t)(((uint32_t)(x)) << EMIOS_C_FCK_SHIFT)) & EMIOS_C_FCK_MASK)

#define EMIOS_C_IF_MASK                          (0x780000U)
#define EMIOS_C_IF_SHIFT                         (19U)
/*! IF - Input Filter
 *  0b0000..Bypassed; the input signal is synchronized before arriving at the digital filter
 *  0b0001..2 cycles
 *  0b0010..4 cycles
 *  0b0100..8 cycles
 *  0b1000..16 cycles
 */
#define EMIOS_C_IF(x)                            (((uint32_t)(((uint32_t)(x)) << EMIOS_C_IF_SHIFT)) & EMIOS_C_IF_MASK)

#define EMIOS_C_DMA_MASK                         (0x1000000U)
#define EMIOS_C_DMA_SHIFT                        (24U)
/*! DMA - Direct Memory Access
 *  0b0..Interrupt request
 *  0b1..DMA request
 */
#define EMIOS_C_DMA(x)                           (((uint32_t)(((uint32_t)(x)) << EMIOS_C_DMA_SHIFT)) & EMIOS_C_DMA_MASK)

#define EMIOS_C_UCPREN_MASK                      (0x2000000U)
#define EMIOS_C_UCPREN_SHIFT                     (25U)
/*! UCPREN - Prescaler Enable
 *  0b0..Disable (no clock)
 *  0b1..Enable
 */
#define EMIOS_C_UCPREN(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_C_UCPREN_SHIFT)) & EMIOS_C_UCPREN_MASK)

#define EMIOS_C_UCPRE_MASK                       (0xC000000U)
#define EMIOS_C_UCPRE_SHIFT                      (26U)
/*! UCPRE - Prescaler
 *  0b00..1
 *  0b01..2
 *  0b10..3
 *  0b11..4
 */
#define EMIOS_C_UCPRE(x)                         (((uint32_t)(((uint32_t)(x)) << EMIOS_C_UCPRE_SHIFT)) & EMIOS_C_UCPRE_MASK)

#define EMIOS_C_ODISSL_MASK                      (0x30000000U)
#define EMIOS_C_ODISSL_SHIFT                     (28U)
/*! ODISSL - Output Disable Select
 *  0b00..0
 *  0b01..1
 *  0b10..2
 *  0b11..3
 */
#define EMIOS_C_ODISSL(x)                        (((uint32_t)(((uint32_t)(x)) << EMIOS_C_ODISSL_SHIFT)) & EMIOS_C_ODISSL_MASK)

#define EMIOS_C_ODIS_MASK                        (0x40000000U)
#define EMIOS_C_ODIS_SHIFT                       (30U)
/*! ODIS - Output Disable
 *  0b0..Enables output pin (the output pin operates normally)
 *  0b1..Disables output pin
 */
#define EMIOS_C_ODIS(x)                          (((uint32_t)(((uint32_t)(x)) << EMIOS_C_ODIS_SHIFT)) & EMIOS_C_ODIS_MASK)

#define EMIOS_C_FREN_MASK                        (0x80000000U)
#define EMIOS_C_FREN_SHIFT                       (31U)
/*! FREN - Freeze Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMIOS_C_FREN(x)                          (((uint32_t)(((uint32_t)(x)) << EMIOS_C_FREN_SHIFT)) & EMIOS_C_FREN_MASK)
/*! @} */

/* The count of EMIOS_C */
#define EMIOS_C_COUNT                            (24U)

/*! @name S - UC Status 0..UC Status 23 */
/*! @{ */

#define EMIOS_S_FLAG_MASK                        (0x1U)
#define EMIOS_S_FLAG_SHIFT                       (0U)
/*! FLAG - Flag
 *  0b0..No event
 *  0b1..Clear the flag (FLAG returns to 0)
 *  0b1..Event has occurred
 */
#define EMIOS_S_FLAG(x)                          (((uint32_t)(((uint32_t)(x)) << EMIOS_S_FLAG_SHIFT)) & EMIOS_S_FLAG_MASK)

#define EMIOS_S_UCOUT_MASK                       (0x2U)
#define EMIOS_S_UCOUT_SHIFT                      (1U)
/*! UCOUT - UC Output Pin
 *  0b0..Negated
 *  0b1..Asserted
 */
#define EMIOS_S_UCOUT(x)                         (((uint32_t)(((uint32_t)(x)) << EMIOS_S_UCOUT_SHIFT)) & EMIOS_S_UCOUT_MASK)

#define EMIOS_S_UCIN_MASK                        (0x4U)
#define EMIOS_S_UCIN_SHIFT                       (2U)
/*! UCIN - UC Input Pin
 *  0b0..Negated
 *  0b1..Asserted
 */
#define EMIOS_S_UCIN(x)                          (((uint32_t)(((uint32_t)(x)) << EMIOS_S_UCIN_SHIFT)) & EMIOS_S_UCIN_MASK)

#define EMIOS_S_OVFL_MASK                        (0x8000U)
#define EMIOS_S_OVFL_SHIFT                       (15U)
/*! OVFL - Overflow
 *  0b0..No overflow
 *  0b1..Overflow
 *  0b1..Return OVFL to 0
 */
#define EMIOS_S_OVFL(x)                          (((uint32_t)(((uint32_t)(x)) << EMIOS_S_OVFL_SHIFT)) & EMIOS_S_OVFL_MASK)

#define EMIOS_S_OVR_MASK                         (0x80000000U)
#define EMIOS_S_OVR_SHIFT                        (31U)
/*! OVR - Overrun
 *  0b0..No overrun
 *  0b1..Overrun
 *  0b1..Return OVR to 0
 */
#define EMIOS_S_OVR(x)                           (((uint32_t)(((uint32_t)(x)) << EMIOS_S_OVR_SHIFT)) & EMIOS_S_OVR_MASK)
/*! @} */

