zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMIOS.h
/* The count of EMIOS_S */
#define EMIOS_S_COUNT                            (24U)

/*! @name ALTA - Alternate Address 0..Alternate Address 23 */
/*! @{ */

#define EMIOS_ALTA_ALTA_MASK                     (0xFFFFU)
#define EMIOS_ALTA_ALTA_SHIFT                    (0U)
/*! ALTA - Alternate Address */
#define EMIOS_ALTA_ALTA(x)                       (((uint32_t)(((uint32_t)(x)) << EMIOS_ALTA_ALTA_SHIFT)) & EMIOS_ALTA_ALTA_MASK)
/*! @} */

/* The count of EMIOS_ALTA */
#define EMIOS_ALTA_COUNT                         (24U)

/*! @name C2 - UC Control 2 0..UC Control 2 23 */
/*! @{ */

#define EMIOS_C2_UCRELDEL_INT_MASK               (0x1FU)
#define EMIOS_C2_UCRELDEL_INT_SHIFT              (0U)
/*! UCRELDEL_INT - Reload Signal Output Delay Interval */
#define EMIOS_C2_UCRELDEL_INT(x)                 (((uint32_t)(((uint32_t)(x)) << EMIOS_C2_UCRELDEL_INT_SHIFT)) & EMIOS_C2_UCRELDEL_INT_MASK)

#define EMIOS_C2_UCPRECLK_MASK                   (0x4000U)
#define EMIOS_C2_UCPRECLK_SHIFT                  (14U)
/*! UCPRECLK - Prescaler Clock Source
 *  0b0..Prescaled clock
 *  0b1..eMIOS module clock
 */
#define EMIOS_C2_UCPRECLK(x)                     (((uint32_t)(((uint32_t)(x)) << EMIOS_C2_UCPRECLK_SHIFT)) & EMIOS_C2_UCPRECLK_MASK)

#define EMIOS_C2_UCEXTPRE_MASK                   (0xF0000U)
#define EMIOS_C2_UCEXTPRE_SHIFT                  (16U)
/*! UCEXTPRE - Extended Prescaler */
#define EMIOS_C2_UCEXTPRE(x)                     (((uint32_t)(((uint32_t)(x)) << EMIOS_C2_UCEXTPRE_SHIFT)) & EMIOS_C2_UCEXTPRE_MASK)
/*! @} */

/* The count of EMIOS_C2 */
#define EMIOS_C2_COUNT                           (24U)


/*!
 * @}
 */ /* end of group EMIOS_Register_Masks */


/*!
 * @}
 */ /* end of group EMIOS_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_EMIOS_H_ */

